
import type { Location } from '../types';

export const locations: Location[] = [
  { id: 2, name: '망우3동주민센터', road_address: '서울특별시 중랑구 겸재로61길 40', lat: 37.59189513, lng: 127.0949177, phone: '02-2094-1957' },
  { id: 175, name: '면목본동주민센터', road_address: '서울특별시 중랑구 면목로 397', lat: 37.58735132, lng: 127.0875562, phone: '02-2094-1957' },
  { id: 176, name: '면목2동주민센터', road_address: '서울특별시 중랑구 동일로101길 20-15', lat: 37.58977212, lng: 127.0790343, phone: '02-2094-1957' },
  { id: 441, name: '신도림동주민센터', road_address: '서울특별시 구로구 신도림로 40', lat: 37.507756, lng: 126.8805903, phone: '02-860-2921' },
  { id: 442, name: '구로제1동주민센터', road_address: '서울특별시 구로구 구일로4길 57', lat: 37.4930394, lng: 126.8757882588, phone: '02-860-2921' },
  { id: 464, name: '오산시보건소', road_address: '경기도 오산시 경기동로 59', lat: 37.159370656, lng: 127.077834015, phone: '' },
  { id: 658, name: '잠원동 주민센터', road_address: '서울특별시 서초구 나루터로 38 (잠원동)', lat: 37.5149681, lng: 127.0139821, phone: '' },
  { id: 659, name: '반포본동 주민센터', road_address: '서울특별시 서초구 신반포로 23 (반포동)', lat: 37.5017471, lng: 126.9872318, phone: '' },
  { id: 823, name: '바다약국', road_address: '경기도 평택시 평택로 41 (평택동)', lat: 36.9911255008, lng: 127.0870808095, phone: '031-8024-4342' },
  { id: 824, name: '민중약국', road_address: '경기도 평택시 평택로 102 (통복동)', lat: 36.99588, lng: 127.083482, phone: '031-8024-4342' },
  { id: 1410, name: '연천군보건의료원', road_address: '경기도 연천군 전곡읍 은대성로 95', lat: 38.02341039, lng: 127.0605854, phone: '031-839-4066' },
  { id: 1655, name: '동두천시 보건소', road_address: '경기도 동두천시 중앙로 167', lat: 37.89661219, lng: 127.051717, phone: '031-860-2251' },
  { id: 1671, name: '군포1동 행정복지센터', road_address: '경기도 군포시 군포로 531', lat: 37.35361204, lng: 126.9455589, phone: '031-390-0251' },
  { id: 1811, name: '역북동', road_address: '경기도 용인시 처인구 명지로 16', lat: 37.23455978, lng: 127.1881482, phone: '' },
  { id: 1862, name: '처인구청', road_address: '경기도 용인시 처인구 금령로 50', lat: 37.23437996, lng: 127.2013372, phone: '' },
  { id: 1977, name: '프라자약국', road_address: '경기도 양주시 고암길 306-77', lat: 37.8367545, lng: 127.0685776, phone: '' },
  { id: 2573, name: '마포 보건소', road_address: '서울특별시 마포구 월드컵로 212 1층', lat: 37.5664461, lng: 126.9019318, phone: '02-3153-9131' },
  { id: 2889, name: '성북구청', road_address: '서울특별시 성북구 보문로 168', lat: 37.58945628, lng: 127.0168496, phone: '02-2241-4409' },
  { id: 2947, name: '장안구보건소', road_address: '경기도 수원시 장안구 송원로 101', lat: 37.30402833, lng: 127.0103129, phone: '031-228-5719' },
  { id: 3463, name: '보라매동주민센터', road_address: '서울특별시 관악구 봉천로 279-8', lat: 37.48817576, lng: 126.932778, phone: '' },
  { id: 3529, name: '부천시보건소', road_address: '경기도 부천시 원미구 옥산로10번길 16', lat: 37.4942085, lng: 123.7810171, phone: '032-625-4213' },
  { id: 3885, name: '평택시 송탄출장소', road_address: '경기도 평택시 경기대로 1366 (서정동)', lat: 37.065809, lng: 127.06509, phone: '031-8024-7234' },
  { id: 4000, name: '공룡약국', road_address: '경기도 평택시 안중읍 안현로서8길 57, 211호 (붐붐프라자)', lat: 36.978966, lng: 126.9191036074, phone: '031-8024-8622' }
];
